downloads/BSA_ultrafiltration_case/BSA_nG200_C1_P20_J20_Lx5_Ly1_Lz25/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     centriMembSolver;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         4;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.02;

purgeWrite      0;

writeFormat       ascii;
writeCompression on;

writePrecision  6;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo 0.2;
maxDeltaT 0.1;

centriMembSolver
{
    solveTracer true;
}

libs ("libGamaPatchAvgTimeWindow.so");


functions
{

    meanU
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");

        // escreve no log
        log             true;

        // quando escrever
        writeControl    timeStep;
        writeInterval   20;

        // OBRIGATÓRIO nesta versão
        writeFields     false;

        // região = todo o domínio
        regionType      all;

        // operação: média volumétrica (vector)
        operation       volAverage;

        fields
        (
            U
        );
    }


    GamaPatchAvgTimeWindow1
    {
        type        GamaPatchAvgTimeWindow;

        // --- settings ---
        patchName   membrane;
        fieldName   Gama;
        timeWindow  1;              // atenção: isto continua a ser 30 steps!

        // --- output control ---
        writeControl writeTime;      // segue o writeInterval do controlDict
        log         true;

        // optional naming
        outputName  Gama_membrane_avgWin;
        fileName    areaAvg_timeWindow.dat;
    }

    CTPatchAvgTimeWindow2
    {
        type        GamaPatchAvgTimeWindow;

        // --- settings ---
        patchName   membrane;
        fieldName   GamaT;
        timeWindow  1;              // atenção: isto continua a ser 30 steps!

        // --- output control ---
        writeControl writeTime;      // segue o writeInterval do controlDict
        log         true;

        // optional naming
        outputName  CT_membrane_avgWi2n;
        fileName    areaAvg_timeWindow2.dat;
    }
        //Ro = mag(vorticity)/2.omega. If Ro <0.1 we have geostrophic flow
    vorticity1
    {
        type            vorticity;
        libs            ("libfieldFunctionObjects.so");
        enabled         true;

        field           U;          // se o teu campo se chama U
        result          vorticity;  // nome do campo de saída

        writeControl    writeTime;
    }

    fieldAverage1
    {
        type            fieldAverage;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;

        fields
        (
            Gama
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
//         restartOnRestart    false;
//         restartOnOutput     false;
        //periodicRestart     true;
        //restartPeriod       5;
        restartTime         2;
    }
    fieldAverage2
    {
        type            fieldAverage;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;

        fields
        (
            GamaT
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
//         restartOnRestart    false;
//         restartOnOutput     false;
        //periodicRestart     true;
        //restartPeriod       5;
        restartTime         2;
    }
}

